Added mermaid charts, markdown tables
